app/controllers/home_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 5
---
  def index
    @posts = Post.limit(5).all