app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "illustration_content_type", "illustration_file_name", "illustration_file_size", "illustration_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "body" = 'Velit, integer diam hac et odio elit? Integer nec pid et nec etiam, turpis porta, pulvinar turpis enim! Sed urna mauris eros placerat odio a? Nascetur sit? Adipiscing tincidunt rhoncus! Sociis placerat, et montes nisi placerat! Nisi magna elementum porta, elit eu tristique, eu, sit placerat non habitasse rhoncus, ridiculus dis magnis. Porttitor eu habitasse turpis in nec elit parturient, nisi integer tempor? Nascetur elementum! Sociis et, vel montes, natoque, cum placerat. Placerat vut dis? Nec dis cursus, penatibus cursus lacus sit aenean nisi! Tincidunt tincidunt ut a lectus sed adipiscing sit lectus porta et eros? Sit magnis dignissim, rhoncus in lectus? Porttitor urna cum! Elementum cras hac adipiscing lacus enim sit dictumst magna amet, parturient velit, auctor egestas sit.